In [1]:
import numpy as np 
import pandas as pd

## Creating a dataframe

In [6]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [9]:
# List
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df = pd.DataFrame(data_list)
columns = ["Name","Age","City","Salary"]
df = pd.DataFrame(data_list, columns=columns)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

## Selection and indexing of coulmn

In [13]:
df['Salary']

0    65000
1    70000
2    62000
3    85000
Name: Salary, dtype: int64

In [15]:
# selecting multiple coulmns
df[["Name", "Salary"]]

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter   62000
3  Linda   85000

## Creating a new coulmn

In [35]:
df["Designation"] = ["Engr", "Doctor", "Captian", "Banker"]
df

    Name  Age      City  Salary Designation
0   John   28  New York   65000        Engr
1   Anna   34     Paris   70000      Doctor
2  Peter   29    Berlin   62000     Captian
3  Linda   42    London   85000      Banker

## Removing a coulmn

In [36]:
df.drop("Designation", axis=1, inplace=True)

In [37]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

## Selecting a row

In [38]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [42]:
df.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

## Selecting a subset rows and coulmn

In [44]:
df.loc[[0,3]][["City", "Salary"]]

       City  Salary
0  New York   65000
3    London   85000

## Conditional selction

In [45]:
df[df['Age']> 30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [46]:
df[(df['Age']> 30) & (df['City'] == "Paris")]

   Name  Age   City  Salary
1  Anna   34  Paris   70000